let handler = m => m;
handler.all = async function (m) {
  let chat = global.db.data.chats[m.chat];
  
  // تحقق إذا كانت دردشة المجموعة محظورة
  if (chat.isBanned) {
    return; // إذا كانت محظورة، لا تفعل شيئًا
  }
  
  if (/^احا$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*احتين علي احتك 🐦🥹*`, m); // رد
  }

  if (/^زياد|زيزو|زوز$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*قلبه 🥺♥*`, m); // رد
  }

  if (/^عبيط|يا عبيط|اهبل|غبي$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*انت يبيبي 🥲❤️*`, m); // رد
  }

  if (/^حمدي$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*اخو زياد عم الكل🤙🏻*`, m); // رد
  }

  if (/^منور|منوره$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*بنوري 🫠💔*`, m); // رد
  }

  if (/^مين عمك$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*عمي هو زيزو 🫶🏻💗*`, m); // رد
  }

  if (/^بوت$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*اسمي زيزو يسطا 🐦💔*`, m); // رد
  }

  if (/^يب$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*قول نعم ياحب 🫶🏻 🐦❤*`, m); // رد
  }

  if (/^ميسي$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*عم العالم ♥😎*`, m); // رد
  }

  if (/^بوت خرا|بوت زفت|خرا عليك$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*🐤💔بص يا حب اذا كان لا يعجبك البوت لا تستخدمه لانك بسب البوت تكون قد سبيت مطور البوت*`, m); // رد
  }

  if (/^بحبك$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*انا اكتر 🐤💔*`, m); // رد
  }

  if (/^شريف|حمدي$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*صديق زياد الروح بالروح 😂♥*`, m); // رد
  }

  if (/^بنورك|دا نورك|نورك الاصل|نور نورك$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*يعم بنوري انا 🫠🐦*`, m); // رد
  }

  if (/^امزح|بهزر$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*ماشي🥲*`, m); // رد
  }

  if (/^في ايه$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*معرفش انت تعرف*`, m); // رد
  }

  if (/^تست$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*انا شغال يا حب 🐦💔*`, m); // رد
  }

  if (/^بتعمل ايه دلوقت$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `باكل ميلكي رايز معه الملايكه`, m); // رد
  }

  if (/^انا جيت$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*نورت البيت 😂❤️*`, m); // رد
  }

  if (/^اخرس|اسكت$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*مش بمزاجك*`, m); // رد
  }

  if (/^حرامي|سارق$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*تتهم بريء بالسرقة من دون تحري او بحث عن حقيقة ليست ملموسة ارحنا واعمل شرطي ثم افتح فمك وثرثر فكلامك كـجاهل واحد بل جهلاً ارحم من حديثك تتصنع دور الشرطي وكأنك محقق بالله اصمت ولا تحرج نفسك ارحنا وارح أعصابك ان اكرمك الله بعقل فبسكوتك اقتل جهلك*`, m); // رد
  }

  if (/^ملل|مللل|ملللل$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*عارفين ف اسكت احسن لك🥱*`, m); // رد
  }

  if (/^السلام عليكم |السلام عليكم ورحمة الله|سلام عليكم|السلام عليكم ورحمة الله وبركاته$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*وعليكم السلام ورحمة الله وبركاته♥*`, m); // رد
  }

  if (/^🤖$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `انت بوت عشان ترسل الملصق ده 🐦`, m); // رد
  }

  if (/^🐦‍⬛$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `🐦`, m); // رد
  }

  if (/^ايه$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*مفيش يا حبي 🐤💔*`, m); // رد
  }

  if (/^نعم$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*حد ناداك 🌚🐦*`, m); // رد
  }

  if (/^كيفك|شخبارك|علوك|عامل ايه|اخبارك|اي الدنيا$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `*الحمد لله و انت*`, m); // رد
  }

  if (/^🐤$/i.test(m.text)) { // بدون بادئة
    conn.reply(m.chat, `🐦`, m); // رد
  }

  return !0;
};
export default handler;
