// By S H A D O W
let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*⌬ ❛╏ سبب الوفاه ${pickRandom(global.hinax)}*\n\n*⌬ ❛╏تاريخ الوفاة ←  ${Math.floor(Math.random() * 30)}/${pickRandom(global.hinaxx)}/ ${pickRandom(global.hina)}*\n\n*⌬ ❛╏الله يرحمك يسطا*\n\n*⌬ ❛╏ BY: 𝒁𝒆𝒛𝒐 𝑩𝒐𝒕*\n\n> تنويه اللعبه للمزح فقط لاتاخذها بجديه واذا ما عجبتك لا تستخدمها`, m)
}
handler.help = ['S H A D O W']
handler.tags = ['S H A D O W']
handler.command = /^موتتي$/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

global.hina =["2023","2024","2025","2026","2027","2028","2029","2030","2031","2032","2033","2034","2035","2036","2037","2038","2039","2040","2041","2042","2043","2044","2045","2046","2047","2048","2049","2050","2051","2052","2053","2054","2055","2056","2057","2058","2059","2060","2061","2062","2063","2064","2065","2066","2067","2068","2069","2070","2071","2072","2073","2074","2075","2076","2077","2078","2079","2080","2081","2082","2083","2084","2085","2089","2090","2091","2092","2093","2094","2095","2096","2097","2098","2099","2100","2101","2102","2103","2104","2105","2106","2107","2108","2109","2110","2111","2112","2113","2114","2115","2116","2117","2118","2119","2120","2121","2122","2123","2124","2125","2126","2127","2128","2129","2130"];

global.hinax =["ملاريا","انتحار","السل رئوي","مرض السكري","حادث مرور","سرطان الكبد","سرطان الدم","السقوط من مرتفع","تعفن الجلد","احتراق","تليف الكبد","الغرق","الأنتحار","القتل","جريمة قتل","كورونا","كوفيد","انسداد رئوي مزمن","ايدز","خطأ طبي","الوقوع من الجبل"," رصاصة طائشة","التعرض لغازات سامة","سرطان الرئة","الجوع","الغرق","الاحتراق","الموت المفاجئ","اختناق","انفجار سيارة","التعرض للأشعاعات ","زلزال","ابتلاع الزرنيخ"];

global.hinaxx =["1","2","3","4","5","6","7","8","9","10","11","12"];
let Bu = Math.floor(Math.random() * 30);
